{"data":{"meta":{"Full Text":""},"content":"\"I recently read your answer to a woman whose husband had a pit bull that didn't get along with their Shar Pei. I now have three pit bulls, all rescues, and while it's not a breed I really wanted, these are some of the most awesome, smart and gentle dogs I have ever owned. As every stray around the boonies seems to end up here, I worried about having pits. I have worked very hard training and socializing them, and they are welcome places where most dogs aren't allowed. Clyde has even been invited to train to be a therapy dog. \r\n\n\"I know some bad pits, but I've seen bad dogs from almost every breed. What I mostly see are bad owners. I was wondering: What is your general opinion of pit bulls?\" \r\n\nThe following text is from a WW I U.S. propaganda poster entitled \"Watchful-Waiting\": \r\n\nThe Germans have their \"Wincht am Rhein,\" the English play \"Lord Save the King,\" the Frenchmen sing their \"Marseillaise,\" while the Russians chant their \"National Hymn.\" \r\n\nOur spirit shuns this warlike ring: Peace breathes in what we proudly sing: \"The Star-Spangled Banner.\" \r\n\nAnd long may it wave, o'er the land of the free and home of the brave. By these colors we stand ever true. \r\n\nThree Cheers for the Red, White and Blue. \r\n\nAbove that text was the image of an American Staffordshire terrier, a pit bull, wrapped in the American flag. \r\n\nNeedless to say, times have changed. \r\n\nThe American Staffordshire terrier used to be the all-American dog. Abroad, pit bulls served with U.S. soldiers, utilizing their superior hearing and sense of smell to warn of mustard gas, shell raids and other lurking dangers, including the presence of enemy spies -- as was the case with Sgt. Stubby, the pit who single-handedly captured a German spy and dragged him to camp by the seat of his pants. For his service he became the only pooch to be promoted to the rank of sergeant. \r\n\nAt home, pit bulls helped the government promote and sell war bonds. Their mugs were featured in Buster Brown ads -- the reliable, sturdy, all-American shoe. And they starred alongside children in Hollywood productions, most notably Petey in \"The Little Rascals.\" In fact, they earned the nickname \"nanny dogs\" from their intrinsically gentle way with children. \r\n\nHistorically, pit bulls have been the dog of choice for the tough patriot -- Teddy Roosevelt and George Patton -- as well as the soulful observer -- Helen Keller and Mark Twain. \r\n\nSo what happened? \r\n\nPart fear campaign, part smear campaign, first the media, then America, systemically turned against this once beloved dog. And just as the media have the influence to elect a president, they have the power to ban a breed. Today, many insurance companies will not issue homeowners insurance on a home that will house a dog that even \"looks like a pit bull.\" \r\n\nThe truth is, nearly 4.7 million people suffer dog bites in the United States each year. Approximately 16 of those cases are fatal, and pit bulls are statistically responsible for about four of those, according to the Center for Disease Control. \r\n\nMy opinion? There's no such thing as a bad breed. All dogs have the potential to be great pets, depending on your needs. And any individual dog that displays aggression should be kept out of homes and neighborhoods with children and other animals. \r\n\nThere are too many dogs, of all shapes and sizes, out there biting people, and the vast majority of those are family pets biting family members. Media hype surrounding pit bulls turns a molehill into a mountain, creates an atmosphere vulnerable to empty legislation and distracts from the real problem: We lack a system that holds pet owners and providers accountable for the actions of those pets. \r\n\nUntil that becomes the point of discussion, the pit bull's best chance is a little positive PR. Tune in to Animal Planet on Sunday, August 24 at 10 p.m. for the series premiere of \"Animal Witness.\" Its inaugural episode, \"The Michael Vick Case,\" details the inhumane treatment Vick's dogs suffered as prisoners in the underground world of dogfighting and spotlights the remarkable recovery many of those dogs have made, in large part due to their natural disposition prevailing against enormous odds. \r\n\nWoof! \r\n\nDog trainer Matthew \"Uncle Matty\" Margolis is co-author of 18 books about dogs, a behaviorist, a popular radio and television guest, and host of the PBS series \"WOOF! It's a Dog's Life!\" Read all of Uncle Matty's columns at the Creators Syndicate Website at www.creators.com, and visit him at www.unclematty.com. Send your questions to dearuncle.gazette@unclematty.com or by mail to Uncle Matty at P.O. Box 3300, Diamond Springs 95619. \r\n\n(c) 2008 Creators Syndicate Inc."},"updated":1424234742}