{"data":{"meta":{"Full Text":"Dam boring","Author":"Derrick Bang"},"content":"Dam boring\r\n\nHeartland fairy tale fails to engage viewers on any level\r\n\nBy Derrick Bang\r\n\nEnterprise entertainment editor\r\n\nWhile arch Americana metaphors have become something of a cottage industry -- consider the popularity of \"O Brother, Where Art Thou?\" -- even fans of the Coen brothers are apt to lose patience with \"Northfork.\"\r\n\nIt simply doesn't go anywhere.\r\n\nAnd the failed journey is oppressively dull.\r\n\nOstensibly the latest in a continuing series of \"American heartland studies\" from independent filmmakers Michael and Mark Polish -- Michael directs, they both write and produce -- \"Northfork\" honors its namesake community only superficially, as a stepping-stone for an at times laughably somber tale of strange characters in an even stranger setting.\r\n\nThe narrative is set in 1955, in the fictional town of Northfork, Mont., two days before what's left of the community will be swept away by the massive lake created by a new hydroelectric dam. As such, Northfork exemplifies many such Great Plains farming communities that were destroyed by similar water projects in the 1940s and '50s.\r\n\nBut if the Polish brothers intend this film to serve as a headstone for the countless, nameless Americans displaced by such maneuvers, they missed the mark by a country mile. \"Northfork\" is too obsessed with heavy-handed symbolism and being weird for the sake of sheer weirdness.\r\n\nMost of the Northfork townsfolk are long gone, but a few stubborn hold-outs remain: tagged for \"removal\" by a six-man team of black-suited \"Evacuation Committee\" men. They're charged with persuading the stragglers to go of their own volition; as we're repeatedly informed, the men in black are not to change anybody's religious beliefs in the process.\r\n\nA few citizens can't leave, such as crusty, cantankerous Father Harlan (Nick Nolte), who after leading his final Sunday service must tend to Irwin (Duel Farnes), a young orphan too sick to be moved. As he passes in and out of fever dreams, Irwin finds himself in the company of four quite bizarre creatures -- the androgynous Flower Hercules (Daryl Hannah), the handless Happy (Anthony Edwards), the aloofly condescending Cup of Tea (Robin Sachs) and the mute Cod (Ben Foster) -- who may or may not be heavenly angels.\r\n\nThe Evacuation Committee members, meanwhile, travel in pairs and carry malevolent black suitcases which, when opened, prove to contain white angel wings -- or so we and the recalcitrant Northfork citizens are told -- which apparently are intended to help their recipients ... um ... fly away.\r\n\nThe characters and encounters in this flimsy story are laced with the sort of groaningly obvious symbolism that high school teachers get all the time from budding poets: The town of Northfork is, of course, about to be literally dammed; one of the odder hold-outs, waiting with two wives in a biblical ark he has constructed, is named Mr. Stalling; Irwin's final chance at being adopted is snuffed out when the parents-to-be, Mr. and Mrs. Hope, prove false; and so forth.\r\n\nThe dialogue is even worse. As one member of the Evacuation Committee, Walter O'Brien (James Woods) is as close as we get to a protagonist, and yet -- if I didn't know better -- I'd swear his line readings were intended to spoof Jack Webb's Joe Friday, from \"Dragnet\"; the various conversations are that woodenly melodramatic.\r\n\nWalter is teamed with his adult son, Willis (filmmaker Mark Polish), which leads to mildly interesting character dynamics ... until people actually start speaking to each other.\r\n\nWoods delivers his short, deliberately ironic statements with the sort of pregnant solemnity actors use when they want us to Pay Attention Because This Is Important. And yet, time and again, we get nothing more meaningful than another sardonic biblical or angelic reference, such as Walter's insistence that \"We'll wing it,\" when asked by Willis how they're to confront a man who lives in his own ark.\r\n\nWalter has his own cross to bear: the knowledge that, sooner or later, he and his son must exhume the coffin of his dead wife, lest it be left behind and (nightmarish thought) bob to the surface of the new lake one future day.\r\n\nThe film boasts a killer cast. Aside from Nolte, Woods, Edwards and Hannah, Peter Coyote, Kyle MacLachlan and a few other familiar faces pop up in brief roles; one gets a sense that serious character actors are as eager to work with Michael and Mark Polish as, say, they were with Woody Allen, back in the day. I suppose the filmmakers talk a good show; as a story pitch, \"Northfork\" probably sounded intriguing.\r\n\nBut the on-screen results are tedious and pointless: just massive plains that are beautiful in their starkness -- much like the establishing shots in \"Fargo\" -- and gorgeously rendered by cinematographer M. David Mullen.\r\n\nIt certainly seems the proper setting for something of gravity, and you'll spend the first half of \"Northfork\" intrigued by what feels like the set-up for a surreal Gothic fantasy ... until, right about the time two Evacuation Committee members get pinned behind their car by a gun-toting homesteader who has nailed his feet to his porch, you begin to realize you've been had.\r\n\nThis emperor, lofty pretensions aside, has no clothes. In the production notes, Michael and Mark seem proudest of the fact that their film was made on an ultra-low budget ... as if that, by itself, confers Significance.\r\n\nNonsense. I say get the dam running, and wash all these one-dimensional archetypes away.\r\n\n-- Reach Derrick Bang at dbang@davisenterprise.net"},"updated":1424234742}