{"data":{"meta":{"Full Text":"It's a wrap -- elevating the act of gift wrapping"},"content":"If you do something a lot, honor the act and make it gracious. Don't come home and toss your keys next to last night's Chinese take-out carton. Hang them on an iron hook. \r\n\nOver the years, when I've sat cross-legged on the floor wrapping birthday gifts until my legs fell asleep and I got up stumbling and stiff like a drunk with arthritis, I've thought of the elegant woman who lived in that house. I bet she never crawled under a bed, rump in the air, looking for a box, or clattered through a stack of tennis rackets to get to her ribbon stash. \r\n\nAfter a certain age, it becomes just plain undignified for a woman to be crawling under a bed, torso to carpet, fanny in the air. When I found myself in this compromising position, rummaging for a gift box (It's under here somewhere!), I resolved to make that the last time I would sacrifice my good reputation to wrap a gift. Even the dogs were looking at me funny.\r\n\nThey reminded me to heed one of my own home design mantras: If you do something a lot, honor the act and make it gracious. Don't come home and toss your keys next to last night's Chinese take-out carton. Hang them on an iron hook. I don't wrap gifts every day, but I do wrap them often enough that I should not be getting down with the dogs and dust bunnies when I do.\r\n\nAs I thought about how I could elevate my gift wrapping act, I remembered a home I toured years ago. It was one of those palatial places, probably owned by some sultan and his Miss America wife. The place had a 20-car garage, an indoor casino, and a Hearst Castle-like swimming pool, but what impressed me most was the gift wrapping room.\r\n\nTalk about a luxury! Over the years, when I've sat cross-legged on the floor wrapping birthday gifts until my legs fell asleep and I got up stumbling and stiff like a drunk with arthritis, I've thought of the elegant woman who lived in that house. I bet she never crawled under a bed, rump in the air, looking for a box, or clattered through a stack of tennis rackets to get to her ribbon stash. And I tried to think of what I could do -- besides nab a rich sultan -- to live more like her. \r\n\nNow I don't have enough space in my home to devote a room to gift wrapping, but I could, possibly, have a gift wrapping station. The thought of having everything -- boxes, bows, ribbons, paper, scissors, and tape -- all in one orderly place hits me like a fantasy on the order of having a personal chef and chauffer who happens to look like George Clooney. \r\n\nWanda Wen, owner of Soolip, a specialty paper store in Los Angeles, and author of \"The Art of Gift Wrapping,\" out next month from PotterCraft\/Random House, was all for my idea. \"If you have a dedicated, well-stocked space, the act of wrapping gifts becomes a joy instead of a chore,\" she said. \"I'm for anything that will encourage people to take the time to make a gift beautiful.\" \r\n\nSo, if you, too, often lose a piece of your dignity every time you wrap, consider Wen's ideas for creating a mini gift wrapping station at home, along with her gracious, but affordable, gift wrapping tips:\r\n\n- Workspace. You don't need much. Carve out a corner of a closet or a niche in the basement. A section of closet with a waist high shelf works well. Or mount a fold-down tabletop against a wall. Drop the tabletop down when you need it; fold it away when not in use. \r\n\n- Paper. A closet hanging rod is perfect for draping sheets of wrapping paper. Or mount a couple 1 1\/2-inch dowels, horizontally, a few inches from the wall, to hang paper on. Make dowels 30 inches long. (Paper doesn't come wider.) Stagger sheets so you can see what's beneath. Another way to store paper is to softly roll it and set it upright in a 12-inch by 12-inch crate. Don't stack rolls because they crush and you can't see ones on the bottom.\r\n\nCost-saving tip: Paper doesn't have to be expensive to be beautiful. Craft paper is an inexpensive all-purpose wrap. Wen also likes to use Sunday comics or glossy magazine pages taped on the diagonal. Always fold raw edges under.\r\n\n- Ribbons and bows. To store ribbons so you can see them, install a few 8-inch pegs, several inches apart, perpendicular to the wall. Hang spools of ribbon, yarn and twine on pegs like bracelets. Put bows, fun toppers and loose pieces of rolled recycled ribbon in a shallow, lidless box. Wen likes to drape ribbons clothesline style on a long cord against the wall. \r\n\nCost-saving tip: Thick, fuzzy yarn from the craft stores is bright, textural and cheap. Wind yarn around the box three times in each direction, so it looks like a bracket, then cinch the intersection with a bow.\r\n\nGood to know: The thinner the ribbon the tighter the bow. Twine gets a small bow; wide ribbon can have bigger ears.\r\n\n- Tools. Keep a bin at the wrapping station stocked with two-sided tape (it's all Wen uses), scissors, colored pens, a hole punch for custom gift tags, and a small ruler. \r\n\nCost-saving tip: Always make your own gift tags. Don't use matching paper. Select from scraps you've saved. (Yes, save your scraps.) Using different paper for gift tag adds texture and dimension to gifts.\r\n\n- Boxes and bags. On a shelf above your work surface or on the floor below keep assorted boxes, and tissue. Use boxes instead of gift bags whenever you can. \"I'm not a fan of preprinted gift bags. They show no ingenuity\" Wen said. \r\n\nI'll work on wrapping with ingenuity right after I've mastered wrapping with dignity. \r\n\nSyndicated columnist Marni Jameson is the author of the just released \"House of Havoc,\" and \"The House Always Wins.\" Contact her through www.marnijameson.com."},"updated":1424234742}