{"data":{"meta":{"Full Text":""},"content":"The Associated Press\r\n\nSAN FRANCISCO -- Since his return from the minor leagues three weeks ago, Todd Linden has learned to calm his nerves. The approach has resulted in better production offensively and defensively.\r\n\nLinden hit the last of San Francisco's four solo home runs, and the Giants rebounded from an injury to starter Kevin Correia to beat the Colorado Rockies 5-3 Wednesday.\r\n\nMoises Alou, Mike Matheny and Ray Durham also homered as the Giants, who won for the fourth time in five games. Matheny added an RBI single.\r\n\nLinden also robbed Todd Helton of a potential two-run, extra-base hit in sixth inning.\r\n\n\"That was one of the best plays that we have seen this season,\" Giants manager Felipe Alou said. \"That was the game right there. If the ball goes over his head it is two runs and who knows what is next.\"\r\n\nLinden caught Helton's two-out drive just in front of the warning track, then tumbled to the ground.\r\n\n\"I knew it was going to be over my head but it didn't have any back spin so I knew I could catch it,\" Linden said. \"It was a good feeling with two guys on, two outs and one of the best hitters in the league up.\"\r\n\nLinden led off the sixth with his fourth homer, and has a combined 34 on the year -- best in the Giants organization. He's hitting .358 (19-for-53) in his second stint with the Giants.\r\n\n\"I'm just being patient and not trying to do too much,\" Linden said. \"There's a good mix on the club with the young guys and the veterans. Alou, Matheny and Durham hit homers and I jumped on the bandwagon.\"\r\n\nCorreia left the game with tightness in his right shoulder.\r\n\n\"It's just a tight spot but it's been causing me to throw differently,\" Correia said. \"I couldn't get on top of the ball. It's been there the last start or two but it's nothing serious. I've been throwing every day.\"\r\n\nGarrett Atkins, JD Closser and Aaron Miles drove in runs for the Rockies, who have lost consecutive road games for the first time since July 23-24 in Pittsburgh.\r\n\n\"A lot of good things happened this month,\" Rockies manager Clint Hurdle said. \"We've raised the bar and are disappointed we didn't win the series. We're not going to accept mediocrity or just being OK.\"\r\n\nJeff Fassero (4-6) won his third straight decision, allowing an unearned run and two hits in three innings. Correia left with an injured right shoulder after giving up one run, two hits and two hits in two innings.\r\n\nArmando Benitez worked the ninth for his fifth straight save since coming off the disabled list two weeks ago, his ninth in 11 chances overall.\r\n\nJeff Francis (12-10) remained winless in three starts in San Francisco, where he has given up 18 runs in 14 1\/3 innings, an 11.04 ERA. He gave up four runs and six hits in six innings and allowed four homers in a game for the second time this month.\r\n\n\"I felt like I had good command but when it came time to make those 3-2 pitches, I came over the plate and they wouldn't miss it,\" Francis said.\r\n\nAtkins hit an RBI double in the first, but Alou homered leading off the second and Matheny homered with two outs for a 2-1 lead. Matheny has a career-high 11 homers, and is one RBI shy of his career-high of 50, set last year with St. Louis.\r\n\nDustan Mohr reached in the fourth on shortstop Angel Chavez's throwing error and scored on Closser's single.\r\n\nDurham, batting .333 since the All-Star break, homered leading off the bottom half for a 3-2 lead and Linden homered leading off the sixth. Lance Niekro tripled off Jamey Wright in the seventh and scored on Matheny's hit.\r\n\nMiles hit an RBI single in the eighth."},"updated":1424234742}