{"data":{"meta":{"Full Text":"Utility checks seem to vanish","Author":"Melanie Turner"},"content":"By Melanie Turner\r\n\nEnterprise staff writer\r\n\nDavis resident Matt Rosenberg got a delinquent notice in the mail from the city of Davis Finance Department informing he had not paid his monthly utility bill on time. But he knew he had and a phone call to the department told him he was not alone.\r\n\nIn fact, hundreds of Davis residents' payments have seemingly vanished.\r\n\nFinance Department employees estimate they've fielded between 200 and 300 phone calls in the last week. Calls were heaviest late last week and through Monday.\r\n\nSomewhere between the U.S. Post Office and the Finance Department, hundreds of utility payments were somehow intercepted before they could be received by the department.\r\n\n\"We could tell we had a problem because the phone was ringing off the hook,\" said revenue analyst Gail Buller.\r\n\nIn an attempt to find any trends that might help solve this mystery, city employees began questioning customers about when and where they mailed their payments.\r\n\nAs a result, the department now estimates that if Davis residents mailed their utility payments anytime between Aug. 9 and Aug. 14, \"chances are good that their checks have gone off to play with these other ones,\" said Buller.\r\n\nBuller said the post office has checked its facility and found nothing. And she said customers have mailed their payments from any number of places, including their offices, homes, street corner mail boxes and at the post office.\r\n\n\"There's no one consistent thing that we could use to narrow it down,\" Buller said, adding that nothing like this has happened in the past.\r\n\nBecause the department has no way of knowing who is delinquent and whose payment is lost, all customers whose payments are not received are sent delinquent notices. By the time customers telephone the city to ask what's going on, most have already verified either online or by telephoning their bank that their checks have not cleared.\r\n\n\"Our customers are the greatest auditors in the world,\" Buller said.\r\n\nCustomers are typically relieved to hear they are not alone in this strange situation. \r\n\n\"As soon as we tell people they're not alone they are just so understanding and so nice,\" Buller said.\r\n\nThe department encourages anyone who has a question about their payment to call 757-5607.\r\n\nAll penalties are being waived and customers are being given the option of either mailing in a new payment or waiting to make a larger payment next month. If the batch of checks turns up, the department plans to send them back to each customer. They will not be cashed.\r\n\n\"It's real unfortunate,\" Buller said. \"I wish I knew the answer to where these checks are.\"\r\n\nShe added, \"We're grateful for everyone's understanding.\""},"updated":1424234742}