{"data":{"meta":{"Full Text":"Iraqis set to scrap U.S. plan"},"content":"BAGHDAD, Iraq (AP) -- A U.N. official said today it was unlikely elections could be held before a U.S.-set June 30 deadline for handing power to the Iraqis, and several Iraqi leaders said there was growing support for scrapping the U.S. blueprint for establishing a new government.\r\n\nU.N. special envoy Lakhdar Brahimi, meanwhile, warned Iraqis to be aware of the risks of civil war as they try to find an acceptable formula for sovereignty.\r\n\n\"I am a little bit disturbed and a little bit uneasy because there are very serious dangers,\" Brahimi said. Civil wars erupt, he said, \"because people are reckless, people are selfish, because people think more of themselves than they do of their country.\"\r\n\nSome members of the U.S.-picked Governing Council were pushing an alternative to the U.S. plan that would call for transferring sovereignty to an expanded council on June 30. The council would then arrange elections before the end of the year.\r\n\nDoubts about the complex U.S. plan were expressed to.day to Brahimi during a meeting with the 25-member Iraqi Governing Council. Brahimi arrived Sunday to try to break an impasse between the Shiite Muslim clergy and the U.S.-led occupation authority on how to establish a new Iraqi government.\r\n\nUnder the American formula, 18 regional caucuses would pick a new legislature, which in turn would choose a provisional government to take power June 30 and serve until elections in 2005.\r\n\nThe U.S. plan, announced Nov. 15, lost ground when Grand Ayatollah Ali al-Husseini al-Sistani demanded legislative elections before June 30. Al-Sistani called the caucuses method \"illegitimate.\"\r\n\nMany top Iraqis also opposed the caucus system because it gave the United States too much influence over the process, an official close to the discussions with the U.N. said.\r\n\nOpposition to the U.S. plan among the Governing Council is significant because it was a signatory of the Nov. 15 agreement, along with the U.S.-led occupation authority.\r\n\nBrahimi told reporters today that he would return to New York and submit his recommendations to U.N. Secretary-General Kofi Annan in a week to 10 days. Asked if the caucus plan was dead, Brahimi said that decision was not his to make but \"I think the people who put it together realize that, at the very least, it needs to be improved considerably.\"\r\n\nA spokesman for Brahimi said today that Sistani's demand for nationwide balloting would probably be too difficult to pull off by July in strife-ridden Iraq.\r\n\nPersistent violence by anti-U.S. insurgents is one of the reasons U.S. officials say elections can't be held before July. Supporters of Saddam Hussein's ousted regime and foreign Islamic militants are believed to be stepping up their attacks in an attempt to derail the creation of a new Iraqi government.\r\n\nIn Baghdad, an explosive detonated as a U.S. military police patrol passed, killing one soldier and wounding two others, a U.S. military spokesman said.\r\n\nBack-to-back suicide bombings Tuesday and Wednesday killed 100 Iraqis, many of them would-be volunteers looking to join the new police or military forces."},"updated":1424234742}