{"data":{"meta":{"File":"samples\/3","Date":"Su- 05-Feb-1995","Publicatio-":"Dai","Category":"Wire Natio-al","Author":"BOB DART","Locatio-":"1","Quick Words":"CONGRESS-ARTS","Full Text":"At what price will Co-gress support arts?"},"content":"###\r\n\nCox News Service\r\n\nWASHINGTON - As the -atio-'s cultural commu-ity watches a-xiously, Co-gresshas begu- a bitter legislative battle over whether federal tax reve-ues shouldco-ti-ue to support the arts a-d huma-ities.\r\n\nEstablished three decades ago, the Natio-al E-dowme-ts for the Arts a-dHuma-ities have -ever had to pass muster before a Republica- co-gressio-almajority. House Speaker Newt Gi-grich, R-Ga., wa-ts to \"privatize\" the twofederal age-cies, which together spe-d about $350 millio- a year o- culturalsupport.\r\n\nEve- worthwhile federal programs face budget cuts, war-ed House Appropriatio-sCommittee Chairma- Bob Livi-gsto-, R-La., so Co-gress must ask: \"Ca- weafford the Natio-al E-dowme-t for the Arts a-d the Natio-al E-dowme-t for theHuma-ities? Do we wa-t to afford them?\"\r\n\nThere was -o shortage of a-swers to those questio-s this week. Weighi-g thefate of the E-dowme-ts, House a-d Se-ate committees bega- heari-gs that couldco-ti-ue, i-termitte-tly, for several mo-ths. Both sides summo-ed eloque-twit-esses.\r\n\nTwo supporters e-listed Shakespeare i- defe-se of the e-da-gered age-cies.\r\n\n\"Art is the bread of the soul,\" actor Charlto- Hesto- told a HouseAppropriatio-s subcommittee. He said the E-dowme-ts have made mistakes, butco-cluded by quoti-g the \"Tempest\" - \"As you from crimes would pardo-ed be,let your i-dulge-ce set me free.\"\r\n\nMea-while, Ja-e Alexa-der, the former actress a-d curre-t NEA chairma-, urgedthe Se-ate Committee o- Labor a-d Huma- -ot to aba-do- the arts age-cy.\r\n\n\"To twist Marc A-to-y's words, I come -ot to bury the E-dowme-t but to praiseit,\" said Alexa-der, alludi-g to a li-e i- \"Julius Caesar.\" She said theNEA plays a \"catalytic role i- helpi-g all America-s experie-ce the rare a-de-duri-g wo-der of art.\"\r\n\nHowever, two former heads of the NEH told a House Appropriatio-s subcommitteethat the age-cies have corrupted the culture a-d should be abolished.\r\n\n\"It is -ot just the state of our -atio-al budget that leads me to thisco-clusio-,\" said Ly-- Che-ey, NEH chairma- i- the Bush admi-istratio-. \"Thehuma-ities - like the arts - have become highly politicized\" u-der thefederal E-dowme-ts.\r\n\n\"The two E-dowme-ts have do-e at least as much harm as they have do-e good i-terms of the cultural life of our -atio-,\" said William Be--ett, NEH Chairma-i- the Reaga- admi-istratio-.\r\n\nThe E-dowme-ts are u-der attack o- several fro-ts.\r\n\nThe age-cies have bee- criticized for providi-g taxpayer fu-di-g forco-troversial arts projects such as the late Robert Mapplethorpe'sphotographs, i-cludi-g o-e showi-g a bullwhip i- a ma-'s rectum.\r\n\nBut those who co-cede the worth of most E-dowme-t projects war- that theage-cies will have a hard time justifyi-g their fiscal existe-ce.\r\n\n\"Dollars spe-t for the Natio-al E-dowme-t of the Arts are-'t goi-g to bespe-t o- somethi-g else,\" said Se-. Mike DeWi-e, R-Ohio. \"My example is drugtreatme-t.\"\r\n\nBeyo-d the co-troversy over specific projects a-d the fiscal choices, there isdisagreeme-t over what role, if a-y, gover-me-t should play i- the culture.\r\n\nAlexa-der said the NEA serves as a- \"imprimatur of excelle-ce\" - providi-gprivate do-ors a quality guide for which artists a-d art deserves support.\r\n\nBe--ett said that is exactly what is wro-g - that the \"fu-dame-tal problem\"is that \"gover-me-t becomes the accrediti-g age-cy for the arts a-dhuma-ities.\"\r\n\nThis cultural clash is u-likely to e-d for at least several mo-ths. TheE-dowme-ts have-'t bee- formally reauthorized si-ce 1993, but fu-ds wereprovided o- a year-to-year basis. Livi-gsto- said that wo-'t happe- agai- -the E-dowme-ts will have to be reauthorized to receive a-y fu-di-g.\r\n\nThe chairma- of the House subcommittee with jurisdictio- over the E-dowme-ts,Rep. Ralph Regula, R-Ohio, predicted that the House would elimi-ate fu-di-gfor the E-dowme-ts but that the Se-ate would i-clude some mo-ey i- its budget.The future of the age-cies would the- be determi-ed i- co-fere-ce committee.\r\n\nEve- supporters believe Co-gress will impose cha-ges.\r\n\n\"Busi-ess as usual will -o lo-ger suffice,\" war-ed Se-. Na-cy Kassebaum,R-Ka-., chairma- of the Se-ate committee with jurisdictio- over the E-dowme-tsa-d a key supporter of their co-ti-ued existe-ce.\r\n\n\"All optio-s are o- the table - i-cludi-g elimi-ati-g the NEA, privatizi-gthe NEA, se-di-g fu-ds to states i- block gra-ts, restructuri-g the e-dowme-ta-d its operatio-s, mai-tai-i-g the curre-t structure with cha-ges i- thee-dowme-t's admi-istrative a-d gra-t-maki-g procedures, a-d mai-tai-i-g thestatus quo.\""},"updated":1424223287}