{"data":{"meta":{"Full Text":"Despite debilitating stroke, friend determined to regain her health"},"content":"There is nothing more precious than your health.\r\n\nI received a major dose of that reality when I visited an old friend trying to come back from a debilitating stroke.\r\n\nLynn is only 54. But a stroke a few months ago caused paralysis on her right side and affected her speech. She's now on the long road of rehabilitation.\r\n\nWe met 30 years ago when I was strumming my guitar, playing clubs around the Sacramento area. Her love of music was apparent, singing along with our musical group from the audience. We quickly learned she had a tremendous voice and more than once encouraged her to climb on stage to sing a song or two.\r\n\nShe was flattered when asked to sing at my wedding in 1972. My wife and I divorced a few years later, but after I remarried, Lynn and I stayed in touch until I moved from the Sacramento area 10 years ago.\r\n\nShe worked for many years as a hairdresser. I guess that's where she learned her gift of gab. When we talked, it wasn't a phone call, but a conversation. My wife Vicki would occasionally get a call when I was out, and sometimes spent hours talking with her -- and she barely knew her.\r\n\nMy ex-wife alerted me to Lynn's medical situation and encouraged me to visit her. Hopefully it would be therapeutic, because Lynn was having trouble with her verbal skills. \r\n\nIt was an electric moment when I walked into her duplex and our eyes met. While she couldn't say my name (at least at first), her infectious smile and tremendous hug assured me that this visit would be special for both of us.\r\n\nFrom her sister I learned that Lynn, always a large woman, had been diagnosed with diabetes a few years ago and had not done a very good job of keeping it under control. Doctors said it probably was one of the contributing factors to her stroke.\r\n\nAt first, she experienced paralysis on her right side and lost her ability to talk. After a few months, some of her motor skills have returned and she can communicate, but labors over many words.\r\n\nUsing a combination of speech, our own form of sign language and the written word, we made a day of it, putting together messages and reminiscing about brighter days for Lynn.\r\n\nWhat came through loud and clear during our five-hour visit was that Lynn was grateful to be alive, to have family and friends to help support her and, above all, has the determination to gain back those vital functions she lost.\r\n\nHer doctors and therapists have helped her make a pretty remarkable recovery so far, but there is so much more to accomplish before she is satisfied.\r\n\nA few years ago, Lynn took a job working with troubled and abused children and had become fully engaged with this second career. \"Her kids\" miss her terribly, showering her with notes and poems, hoping she will soon return to her job.\r\n\nShe's mad for allowing herself to gain so much weight, letting her health slip into dangerous territory that resulted in the stroke. Her frustration trying to communicate was often times evident.\r\n\n\"I know what I want to say, I just can't say it,\" she bristled. And, at least for now, she even has trouble writing some of those things on paper.\r\n\nBut her therapy continues. She's lost more than 100 pounds. Her motor skills continue to improve. She's walking short distances nightly to build strength. She's showing the determination of Stallone's Rocky Balboa.\r\n\n\"I want to be with 'my kids,' \" she said. \"I will be back with 'my kids,' I know it.\"\r\n\nWe're praying for Lynn to regain that which she's lost. I know she still has a song or two inside waiting to get outside. I'd love to hear that golden voice again. \r\n\nBill James is editor\/assistant publisher of the Daily Republic. His e-mail address is bjames@dailyrepublic.net."},"updated":1423901368}