{"data":{"meta":{"Full Text":"Bad break for Williams, D'backs"},"content":"The Associated Press\r\n\nThe Los Angeles Dodgers caught a break when Eric Karros didn't seriously injure himself after fouling a ball off his foot. Matt Williams and the Arizona Diamondbacks weren't so lucky.\r\n\nWilliams, Arizona's All-Star third baseman, broke a bone in his right foot Tuesday in the Diamondbacks' 12-3 loss to the Seattle Mariners in Tucson, Ariz.\r\n\n\"Obviously, I'm disappointed,\" Williams said. \"I was really looking forward to beginning the season and playing on opening day. There are some things, especially in this game, that you can't control.\"\r\n\nWilliams fouled a pitch from Frankie Rodriguez off the foot in the second inning and was in obvious pain, but completed his at bat, lining out to center. He was replaced by Lenny Harris in the top of the third inning.\r\n\nWilliams immediately underwent an X-ray, which showed his second metatarsal was broken. He left for Phoenix, where he was to meet with foot specialist Dr. Peter Mitchell.\r\n\n\"It's a tremendous loss,\" teammate Greg Colbrunn said. \"He's the key hitter in our lineup and defensively. . . . You can't sit around and cry about it. You have to move on and do other things to help make up for it.\"\r\n\nVirtually the same injury sidelined him for 68 games with the San Francisco Giants in 1995.\r\n\nThe news was better for the Dodgers, who received a scare when Karros fouled a ball off his left ankle in the seventh inning and was carted off the field.\r\n\nX-rays revealed no fracture, and Karros is expected to be sidelined for just a couple of days with a badly bruised left ankle.\r\n\nShawn Green hit two solo home runs as the Dodgers beat Montreal 4-3 in 10 innings at Jupiter, Fla.\r\n\nElsewhere in baseball:\r\n\n* At Peoria, Ariz., left-hander Shawn Estes, out of the rotation since March 8 with shoulder inflammation, pitched four innings to earn the victory as the San Francisco Giants beat the San Diego Padres 7-5.\r\n\nEstes allowed three runs -- two earned -- and five hits. Estes had pitched in one minor league game and one intrasquad game to tune up for his return.\r\n\nRich Aurilia went 3-for-4 with a home run, a double, two runs and three RBIs for the Giants. \r\n\n* At Tempe, Ariz., Anaheim right-hander Jason Dickson made his second consecutive strong outing in his comeback from shoulder surgery that sidelined him last season as the Angels beat the Oakland Athletics 3-2 on Tuesday. At Winter Haven, Fla., John Rocker received a warm reception from Cleveland fans who have been hearing trade rumors and Keith Lockhart hit an inside-the-park homer, leading Atlanta to a 7-6 win over the Indians.\r\n\n* Rocker, the Braves' notorious closer, pitched an uneventful seventh inning as the Braves won for just the second time in their last 10 exhibition games.\r\n\nThe left-hander has been mentioned in trade rumors with the Indians and Montreal Expos.\r\n\n\"What rumors?\" Cleveland GM John Hart said. \"We've had no conversations at all with the Braves. I don't know where that's coming from. It's not even worth a comment.\"\r\n\n* At Tokorozawa, Japan, Mark Grace and Damon Buford hit home runs in the ninth inning, rallying the Cubs to a 6-5 victory over the Seibu Lions.\r\n\nGrace had a solo shot with one out and Buford connected for a two-run drive with two outs.\r\n\nHaving ended a four-game skid, the Cubs hope their good fortune continues today when they play the New York Mets at the Tokyo Dome in the major league opener. Jon Lieber will pitch for the Cubs against Mike Hampton.\r\n\n\"The real season starts tomorrow,\" said Sammy Sosa, who ended the spring in an 0-for-15 slump. \"Tomorrow is opening day, and I'll be ready.\"\r\n\n* At Tokyo, Bill Pulsipher gave up five runs and seven hits in three innings as the Mets lost to the Tokyo Giants 9-5.\r\n\n\"Just as you have to put a game behind you in the regular season, we have to put this one behind us and start again,\" Mets manager Bobby Valentine said."},"updated":1424234742}