{"data":{"meta":{"File":"samples\/14","Date":"Thu 02-Sep-1999","Publication":"Dai","Category":"Wire National","Author":"WIREA","Location":"7","Quick Words":"PM-GoodNino","Full Text":"El Nino wasn't"},"content":"so bad after all\r\n\nWASHINGTON###\r\n\n (AP) - For a while it seemed as though everything from tornadoes totoadstools and hailstorms to hemlines was being blamed on El Nino. Now, itturns out the periodic weather event produced a lot more good than bad.\r\n\nThat's the conclusion of climatologist Stanley A. Changnon, who calculatedthat while the 1997-98 El Nino can be blamed for 189 deaths, it also can becredited with preserving 850 lives that would have been lost in normal winterand hurricane seasons.\r\n\nAnd its $4.2 billion to $4.5 billion in damage is far outweighed by nearly $20billion in benefits, Changnon reports in the September issue of the Bulletinof the American Meteorological Society.\r\n\n\"If you treat it as an economic outcome for the country ... most of thecountry benefited,\" Changnon said.\r\n\nTrue, the El Nino weather phenomenon was blamed for major storms in Californiaand, by some, for deadly tornadoes in Florida and an ice storm in theNortheast.\r\n\nBut it also produced an exceptionally mild winter in most of the Northernstates and blocked Atlantic Coast hurricanes.\r\n\n\"I figured, just watching what was happening, that it was going to be azero-sum game but it turned out far from that,\" Changnon said in a telephoneinterview from his Mahomet, Ill., home.\r\n\nMichael Glantz, an El Nino expert at the National Center for AtmosphericResearch in Colorado, was skeptical.\r\n\n\"It's a noble attempt but I wouldn't take the numbers to the bank,\" he said.\"I'm wary of trying to cost out weather events.\"\r\n\nIn his paper, Changnon admitted there could be up to a 30 percent variation inthe costs and benefits cited, but noted that would still produce considerablymore benefit than loss.\r\n\nJim O'Brien, director of the Center for Ocean-Atmosphere Prediction Studies atFlorida State University, welcomed Changnon's report.\r\n\n\"El Nino is a good dude for the United States,\" O'Brien said in a telephoneinterview. \"In actuality, La Nina is worse for the United States, there aremore hurricanes, there is an increase in tornadoes and they spread over awider region ... there is drought,\" he said.\r\n\nEl Nino is a periodic warming of the water in the eastern Pacific Ocean, whichshifts weather patterns arriving from that area and can affect the climateworldwide. La Nina, an abnormal cooling of the Pacific sea surface, iscurrently taking place. It, too, can affect the world's weather. La Ninassometimes occur between El Ninos.\r\n\nAccording to Changnon, as few as 100 people died in winter cold and stormsduring the 1997-98 El Nino, well below the average of 850 in recent years.\r\n\nGenerally mild temperatures \"greatly reduced lives lost to extreme cold,\"Changnon wrote, and there also were fewer weather-related auto accidents anddeaths in winter storms.\r\n\n\"El Nino's influence on the atmosphere led to the elimination of majorAtlantic hurricanes during 1997,\" he added. That meant no lives lost comparedto the average of 20 in recent years and it meant an enormous savings for homeand business owners, governments and insurers.\r\n\nThe mild temperatures also saved businesses and homeowners millions of dollarsthey didn't have to spend on heating fuel, Changnon said, though that also canbe calculated as a loss for utilities.\r\n\nLack of demand for heating fuel made oil a glut on the market, resulting inthe price of gasoline dropping to as low as 80 cents a gallon in some parts ofthe country, O'Brien pointed out.\r\n\nIn addition to the economic benefits of the mild winter, Changnon reported,\"Thousands went out of doors more, millions went shopping, many altered theirtypes of recreation, and almost everyone enjoyed better health than in normalwinters.\"\r\n\nGlantz raised the \"question of what is a normal year, which no one hasdefined. No one has calculated to the U.S. the cost of weather in a normalyear. Extremes are going on every year,\" he commented.\r\n\n\"It's admirable that he tried to put numbers on this stuff,\" Glantzconcluded, but \"it's very hard to attribute weather events.\""},"updated":1424234742}