{"data":{"meta":{"File":"samples\/3","Date":"Sun 05-Feb-1995","Publication":"Dai","Category":"Wire National","Author":"BOB DART","Location":"1","Quick Words":"CONGRESS-ARTS","Full Text":"At what price will Congress support arts?"},"content":"###\r\n\nCox News Service\r\n\nWASHINGTON - As the nation's cultural community watches anxiously, Congresshas begun a bitter legislative battle over whether federal tax revenues shouldcontinue to support the arts and humanities.\r\n\nEstablished three decades ago, the National Endowments for the Arts andHumanities have never had to pass muster before a Republican congressionalmajority. House Speaker Newt Gingrich, R-Ga., wants to \"privatize\" the twofederal agencies, which together spend about $350 million a year on culturalsupport.\r\n\nEven worthwhile federal programs face budget cuts, warned House AppropriationsCommittee Chairman Bob Livingston, R-La., so Congress must ask: \"Can weafford the National Endowment for the Arts and the National Endowment for theHumanities? Do we want to afford them?\"\r\n\nThere was no shortage of answers to those questions this week. Weighing thefate of the Endowments, House and Senate committees began hearings that couldcontinue, intermittently, for several months. Both sides summoned eloquentwitnesses.\r\n\nTwo supporters enlisted Shakespeare in defense of the endangered agencies.\r\n\n\"Art is the bread of the soul,\" actor Charlton Heston told a HouseAppropriations subcommittee. He said the Endowments have made mistakes, butconcluded by quoting the \"Tempest\" - \"As you from crimes would pardoned be,let your indulgence set me free.\"\r\n\nMeanwhile, Jane Alexander, the former actress and current NEA chairman, urgedthe Senate Committee on Labor and Human not to abandon the arts agency.\r\n\n\"To twist Marc Antony's words, I come not to bury the Endowment but to praiseit,\" said Alexander, alluding to a line in \"Julius Caesar.\" She said theNEA plays a \"catalytic role in helping all Americans experience the rare andenduring wonder of art.\"\r\n\nHowever, two former heads of the NEH told a House Appropriations subcommitteethat the agencies have corrupted the culture and should be abolished.\r\n\n\"It is not just the state of our national budget that leads me to thisconclusion,\" said Lynn Cheney, NEH chairman in the Bush administration. \"Thehumanities - like the arts - have become highly politicized\" under thefederal Endowments.\r\n\n\"The two Endowments have done at least as much harm as they have done good interms of the cultural life of our nation,\" said William Bennett, NEH Chairmanin the Reagan administration.\r\n\nThe Endowments are under attack on several fronts.\r\n\nThe agencies have been criticized for providing taxpayer funding forcontroversial arts projects such as the late Robert Mapplethorpe'sphotographs, including one showing a bullwhip in a man's rectum.\r\n\nBut those who concede the worth of most Endowment projects warn that theagencies will have a hard time justifying their fiscal existence.\r\n\n\"Dollars spent for the National Endowment of the Arts aren't going to bespent on something else,\" said Sen. Mike DeWine, R-Ohio. \"My example is drugtreatment.\"\r\n\nBeyond the controversy over specific projects and the fiscal choices, there isdisagreement over what role, if any, government should play in the culture.\r\n\nAlexander said the NEA serves as an \"imprimatur of excellence\" - providingprivate donors a quality guide for which artists and art deserves support.\r\n\nBennett said that is exactly what is wrong - that the \"fundamental problem\"is that \"government becomes the accrediting agency for the arts andhumanities.\"\r\n\nThis cultural clash is unlikely to end for at least several months. TheEndowments haven't been formally reauthorized since 1993, but funds wereprovided on a year-to-year basis. Livingston said that won't happen again -the Endowments will have to be reauthorized to receive any funding.\r\n\nThe chairman of the House subcommittee with jurisdiction over the Endowments,Rep. Ralph Regula, R-Ohio, predicted that the House would eliminate fundingfor the Endowments but that the Senate would include some money in its budget.The future of the agencies would then be determined in conference committee.\r\n\nEven supporters believe Congress will impose changes.\r\n\n\"Business as usual will no longer suffice,\" warned Sen. Nancy Kassebaum,R-Kan., chairman of the Senate committee with jurisdiction over the Endowmentsand a key supporter of their continued existence.\r\n\n\"All options are on the table - including eliminating the NEA, privatizingthe NEA, sending funds to states in block grants, restructuring the endowmentand its operations, maintaining the current structure with changes in theendowment's administrative and grant-making procedures, and maintaining thestatus quo.\""},"updated":1423901368}